
#05: Membalik urutan baris dan kolom pada Data Frame


Import Modules

In [30]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.3.3
2.3.4

Persiapan Data Frame

In [31]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)), 
                  columns=cols)
df

   A  B  C  D  E
0  5  8  8  4  4
1  7  5  9  1  5
2  4  9  2  9  2
3  2  4  1  6  4
4  3  2  5  3  5

Membalik urutan kolom

In [32]:

df.loc[:, ::-1]

   E  D  C  B  A
0  4  4  8  8  5
1  5  1  9  5  7
2  2  9  2  9  4
3  4  6  1  4  2
4  5  3  5  2  3

Membalik urutan baris

In [33]:

df.loc[::-1]

   A  B  C  D  E
4  3  2  5  3  5
3  2  4  1  6  4
2  4  9  2  9  2
1  7  5  9  1  5
0  5  8  8  4  4

Membalik urutan baris dan melakukan penyesuaian ulang index

In [34]:
df.loc[::-1].reset_index(drop=True)

   A  B  C  D  E
0  3  2  5  3  5
1  2  4  1  6  4
2  4  9  2  9  2
3  7  5  9  1  5
4  5  8  8  4  4

#06: Mengganti nama (label) kolom pada Data Frame

Mengganti nama (label) untuk sebuah kolom pada Data Frame

In [35]:
df.rename(columns={'C':'Hobi'})

   A  B  Hobi  D  E
0  5  8     8  4  4
1  7  5     9  1  5
2  4  9     2  9  2
3  2  4     1  6  4
4  3  2     5  3  5

Mengganti nama (label) untuk banyak kolom pada Data Frame

In [36]:
df.rename(columns={'A':'Nama', 'B':'Alamat', 'D':'Kota'})

   Nama  Alamat  C  Kota  E
0     5       8  8     4  4
1     7       5  9     1  5
2     4       9  2     9  2
3     2       4  1     6  4
4     3       2  5     3  5

#07: Menghapus (drop) missing values (NaN)

Persiapan Data Frame

In [37]:
n_rows = 30
n_cols = 4
cols = ['A', 'B', 'C', 'D']

df = pd.DataFrame(np.random.randn(n_rows, n_cols), columns=cols)

nan_mask = np.random.rand(n_rows, n_cols) < 0.2
df[nan_mask] = np.nan

df = df.reset_index()
df.head()

   index         A         B         C         D
0      0  0.901625 -1.971789  0.427340  0.476503
1      1  2.184127  0.118240  1.611213  0.900479
2      2  0.307789       NaN -1.265451 -0.079595
3      3  0.572529 -0.687516       NaN -0.514767
4      4 -0.424904 -2.079299  0.042173 -1.617009

In [38]:
df = df.rename(columns={'index':'Z'})
df.head()

   Z         A         B         C         D
0  0  0.901625 -1.971789  0.427340  0.476503
1  1  2.184127  0.118240  1.611213  0.900479
2  2  0.307789       NaN -1.265451 -0.079595
3  3  0.572529 -0.687516       NaN -0.514767
4  4 -0.424904 -2.079299  0.042173 -1.617009

In [39]:
df_backup = df.copy(deep=True)

Menghapus (drop) setiap kolom yang mengandung missing values

In [40]:
df = df.dropna(axis='columns') 
df.head()

   Z
0  0
1  1
2  2
3  3
4  4

Menghapus (drop) setiap baris yang mengandung missing values

In [41]:
df = df_backup.copy(deep=True)
df = df.dropna(axis='rows')
df.head()

   Z         A         B         C         D
0  0  0.901625 -1.971789  0.427340  0.476503
1  1  2.184127  0.118240  1.611213  0.900479
4  4 -0.424904 -2.079299  0.042173 -1.617009
5  5 -0.472398 -0.737768 -0.899920 -0.721915
6  6  0.212671 -0.882435 -0.612755 -1.169998

Persentase missing values untuk tiap kolom

In [42]:

df = df_backup.copy(deep=True)
df.isna().mean()

Z    0.000000
A    0.166667
B    0.133333
C    0.100000
D    0.166667
dtype: float64

Menghapus (drop) setiap kolom yang mengandung missing values berdasarkan threshold

In [43]:
treshold = len(df) * 0.9
df = df.dropna(thresh=treshold, axis='columns')
df.head()

   Z         C
0  0  0.427340
1  1  1.611213
2  2 -1.265451
3  3       NaN
4  4  0.042173

#08: Memeriksa kesamaan antar dua buah kolom (Series) pada Data Frame


Persiapan Data Frame

In [44]:
data = {'A':[15, 15, 18, np.nan, 12], 
        'B':[15, 15, 18, np.nan, 12]}

df = pd.DataFrame(data)
df

      A     B
0  15.0  15.0
1  15.0  15.0
2  18.0  18.0
3   NaN   NaN
4  12.0  12.0

Mengenal Pandas Series

In [45]:
df['A']

0    15.0
1    15.0
2    18.0
3     NaN
4    12.0
Name: A, dtype: float64

In [46]:
type(df['A'])

pandas.core.series.Series

In [47]:
type(df)

pandas.core.frame.DataFrame

Memeriksa kesamaan dengan operator ==

In [48]:
df['A'] == df['B']

0     True
1     True
2     True
3    False
4     True
dtype: bool

Memeriksa kesamaan dengan method equals()

In [49]:
df['A'].equals(df['B'])

True

Memeriksa kesamaan antar dua Data Frame

In [50]:
df1 = df.copy(deep=True)

df.equals(df1)

True

In [51]:
df == df1

       A      B
0   True   True
1   True   True
2   True   True
3  False  False
4   True   True